
import React from 'react';
import Accordion from '@mui/material/Accordion';
import AccordionSummary from '@mui/material/AccordionSummary';
import AccordionDetails from '@mui/material/AccordionDetails';
import Typography from '@mui/material/Typography';
import { useEffect } from 'react'
import Stopwatch from './Stopwatch';



const MyAccordion = () => {

    useEffect(() => {
        document.title = 'training';
        // You can replace 'My Custom Page Title' with the desired title for your page.
      }, []);


  return (
    <>
    <div className='container title'>
    <h6>Изберете тип тяло: </h6>
    <Accordion>
      <AccordionSummary>
        <Typography variant="h6" component="div" style={{ fontWeight: 'bold'}}>Ектоморф</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
         Този тип хора имат тънка кожа на лицето и тялото, раменете са тесни, ръцете са слаби. Гръдният кош е удължен или плосък, а мускулатурата е слаборазвита. Положителното при ектоморфа е, че не е предразположен към трупане на мазнини. Трениращите с такъв тип телосложение трудно качват мускулна маса и лесно я губят. Най-важното за един фитнес ентусиаст с ектоморфно телосложение е да покачи чистата мускулна маса. Едни от най-известните личности с чист ектоморфен тип тяло са Брус Лий, Брат Пит и Камерън Диас.
         <Accordion>
      <AccordionSummary>
        <Typography variant="h8" component="div" style={{ fontWeight: 'bold'}}>Хранителни и тренировъчни препоръки при ектоморф</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
        Провеждайте силови тренировки в рамките на 3-4 пъти седмично.
 Изпълнявайте тренировката в пълния й обем дори това да означава повече време за почивка между упражненията.
 Правете по 5-8 повторения в серия.
 Сведете кардио тренировките (бягане, плуване, колоездене и други спортове от този тип) до минимум, което не означава да ги изключите изцяло. Препоръчителната продължителност на една кардио тренировките е 15 до 20 минути.
 За този тип телосложение набавянето на достатъчно храна е от ключово значение. Простено ви е да пропуснете тренировка, но не и да пропускате хранения.
 Съотношение на макронутриентите в хранителния режим трябва да е приблизително 25-30% белтъчини, 55-60% въглехидрати и 15-20% мазнини.
        </Typography>
      </AccordionDetails>
    </Accordion>
        </Typography>
      </AccordionDetails>
    </Accordion>
    <Accordion>
      <AccordionSummary>
        <Typography variant="h6" component="div" style={{ fontWeight: 'bold'}}>Мезоморф</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
        Този тип хора се отличават със силно развит скелет и мускулатура. За мезоморфа са характерни средно висок или висок ръст, широки рамене, мощен гръден кош и средно едра глава.  Мезоморфите лесно качват чиста мускулна маса и лесно я поддържат, като я запазват в значителна степен дори при по-дълги паузи в тренировките. Класическите примери за мезоморфи са екшън героите, с които сме израснали – Арнолд Шварценегер, Силвестър Сталоун и Брус Уилис.
        <Accordion>
      <AccordionSummary>
        <Typography variant="h8" component="div" style={{ fontWeight: 'bold'}}>Хранителни и тренировъчни препоръки при мезоморф</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
        Съчетавайте многоставните базови упражнения с различни упражнения за оформяне на мускулите. Колкото по-разнообразна е тренировъчната ви програма, толкова по-симетрично тяло ще постигнете.
 Тренировките трябва да са относително по-продължителни с кратки почивки между упражненията.
 Правете по 8-12 повторения в серия.
 Препоръчителната продължителност на кардио тренировките е 25 до 30 минути.
 Съотношение на макронутриентите в хранителния режим трябва да е приблизително 30% белтъчини, 40% въглехидрати и 30% мазнини.
        </Typography>
      </AccordionDetails>
    </Accordion>
        </Typography>
      </AccordionDetails>
    </Accordion>
    <Accordion>
      <AccordionSummary>
        
        <Typography variant="h6" component="div" style={{ fontWeight: 'bold' }}>Ендоморф</Typography>
        
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
        Ендоморфите обикновено се отличават със среден ръст, къса шия, развити вътрешни кухини на тялото и склонност към трупане на телесни мазнини, ако не се занимават активно със спорт. Трениращите с този тип телосложение лесно качват килограми, но за тях е проблем да оформят релефна мускулатура. При сериозни и упорити тренировки обаче могат успешно да постигнат целите си. Важното за всеки ендоморф е първо да се избави от излишните мазнини. Едни от най-известните личности с ендоморфен тип тяло са Дженифър Лопез, Бионсе Ноулс и Филип Хофман.
        <Accordion>
      <AccordionSummary>
        <Typography variant="h8" component="div" style={{ fontWeight: 'bold'}} >Хранителни и тренировъчни препоръки при ендоморф</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>
        Силовите тренировки трябва да са с повече повторения и кратки почивки между упражненията.
 Правете между 8-15 повторения в серия
 Нужна е повече аеробна дейност (бягане, каране на колело или велоергометър, плуване). Препоръчителна продължителност на кардио тренировките е над 35-40 минути
 След изчистване на мазнините (или поне на голям процент от тях), може да тренирате като мезоморфа, но трябва да внимавате с храната. Диетата е много важна в случая.
 Ендоморфите трябва да са внимателни с въглехидратите, тъй като са твърде чувствителни към инсулина. Най-добрата комбинация на макронутриенти е 35-40% белтъчини, 20-40% Въглехидрати, 25-40% мазнини.
        </Typography>
      </AccordionDetails>
    </Accordion>
        </Typography>
      </AccordionDetails>
    </Accordion>
   
    </div>

    

 <h3> Позитивно мислене + Действие = Положителен резултат</h3>
  <h3>Негативно мислене + Бездействие = Отрицателен резултат</h3>
  <Stopwatch />
    </>
    
  );
};

export default MyAccordion;
